---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.IExternalResourceUIServer
source: html/f1f17bf8-e601-503f-2e0b-cb034de308b0.htm
---
# IExternalResourceUIServer Members

Implement this method to return the id of the server which is associated with this UI server.